0
000
04
05
1
10
100
10th
11
11th
12
120
12th
13
14
146
15
150
151
16
160
17
18
18th
19
1990s
1999
1st
2
20
200
2000
2001
2002
2003
2004
2005
2006
2007
2008
2012
21
22
23
24
25
250
26
27
28
29
2nd
3
30
300
31
32
33
34
35
350
36
37
38
39
3g
3q
3rd
4
40
400
41
42
43
44
45
46
47
48
49
49ers
5
50
500
51
52
53
54
55
56
57
58
59
6
60
600
61
62
63
64
65
650
66
666666
67
68
69
7
70
700
71
72
74
75
76
77
78
79
8
80
800
81
82
84
85
86
87
88
89
9
90
900
92
93
94
95
96
99
a
aa
aaron
abandoned
abbas
abbey
abc
abducted
ability
able
aboard
about
above
abroad
absence
abu
abuja
abuse
abuses
ac
acc
accept
accepted
access
accident
accord
according
account
accounting
accounts
accused
accuses
accusing
ace
acknowledged
acquire
acquired
acquires
acquiring
acquisition
across
act
action
actions
active
activist
activists
activities
activity
actually
ad
adam
adapters
add
added
adding
addition
additional
address
adds
administration
admits
admitted
adobe
adopt
adopted
adrian
ads
advance
advanced
advances
advantage
advertising
advice
advocates
aerospace
affairs
affect
affected
afghan
afghanistan
afp
africa
african
after
afternoon
ag
again
against
agassi
age
agencies
agency
agenda
agent
agents
aggressive
ago
agree
agreed
agreeing
agreement
agreements
agrees
ahead
aid
aide
aides
aids
ailing
aim
aimed
aiming
aims
air
airbus
aircraft
airline
airlines
airport
airways
al
alabama
alan
alaska
alert
alex
alexander
ali
alitalia
alive
all
allawi
allegations
alleged
allegedly
allen
alliance
allies
allow
allowed
allowing
allows
ally
almost
alone
along
already
also
alternative
although
always
am
amateur
amazon
ambassador
ambitions
ambitious
amd
amelie
america
american
americans
amid
among
amount
amp
amsterdam
an
anaheim
analysis
analyst
analysts
ancient
and
anderson
andre
andreas
andrew
andy
angel
angeles
angels
anger
angry
animal
animals
animation
ankle
annan
anniversary
announce
announced
announcement
announces
announcing
annual
another
answer
answers
anthony
anti
anticipated
antitrust
antivirus
antonio
anwar
any
anyone
anything
aol
ap
apart
apparent
apparently
appeal
appealed
appeals
appear
appearance
appeared
appears
apple
application
applications
appointed
approach
approval
approve
approved
approves
april
arab
arabia
arafat
arbitration
arctic
are
area
areas
aren
arena
argentina
arial
ariel
aristide
arizona
arm
armed
arms
army
around
arrest
arrested
arrests
arrival
arrive
arrived
arrives
arsenal
arsene
art
artest
arthritis
article
as
asbestos
asia
asian
aside
ask
asked
asking
asks
aspx
assassination
assault
assembly
asset
assets
assistant
assists
associated
associates
association
astronaut
astronauts
astronomers
astros
asylum
at
ata
athens
athletes
athletic
athletics
atlanta
atlantic
atmosphere
atomic
atop
atp
attack
attacked
attacks
attempt
attempts
attend
attendants
attention
attorney
attract
au
auburn
auction
audience
audio
audit
aug
august
austin
australia
australian
austria
authorities
authority
auto
automaker
automotive
availability
available
average
aviation
aviv
avoid
awaited
awaits
award
awarded
awards
away
aziz
b
ba
baby
back
backed
backing
backs
backup
bad
baghdad
balance
bali
ball
ballmer
ballot
ballots
baltimore
ban
band
bangalore
bangkok
bangladesh
bank
bankers
banking
bankrupt
bankruptcy
banks
banned
bar
barcelona
barely
barrel
barrels
barry
base
baseball
based
baseman
bases
basic
basis
basketball
bat
battered
batteries
battery
batting
battle
battled
battles
battling
bay
bayern
bbc
bc
bcs
be
bea
beach
bears
beat
beaten
beating
beats
became
because
beckham
become
becomes
becoming
beef
been
beer
before
began
begin
beginning
begins
begun
beheaded
behind
beijing
being
belarus
beleaguered
belgian
belgium
believe
believed
believes
bell
below
ben
bench
benefit
benefits
bengals
berlin
berlusconi
bernie
berth
beslan
best
beta
better
between
beyond
bhp
bid
bidding
bids
big
bigger
biggest
bigley
bill
billion
billionaire
billions
bills
bin
bird
birds
birmingham
birth
bit
bitter
black
blackberry
blackburn
blade
blair
blame
blamed
blast
blasts
blew
bln
bloc
block
blockbuster
blocked
blocks
blog
blood
bloody
bloomberg
blow
blu
blue
bluetooth
board
bob
bobby
bodies
body
boeing
bolster
bolton
bomb
bomber
bombers
bombing
bombings
bombs
bond
bonds
book
books
boom
boost
boosted
boosting
boosts
border
born
boss
boston
both
bottom
bought
bounce
bound
bowl
box
boxing
boy
boycott
boys
br
brad
brain
branch
brand
brands
branson
braves
brawl
brazil
brazilian
break
breaking
breaks
breakthrough
breeders
brett
brewers
brian
bridge
brief
briefly
bright
bring
bringing
brings
britain
british
briton
broad
broadband
broadcast
broke
broken
broker
brokerage
broncos
bronze
brother
brothers
brought
brown
browns
browser
bruce
brussels
bryant
bt
budget
buffalo
build
building
buildings
built
bull
bulls
buried
bus
busch
bush
business
businesses
busy
but
button
buy
buyers
buying
buyout
buys
by
c
ca
cabinet
cable
cairo
cal
calendar
calif
california
call
called
calling
calls
calm
cambodia
came
camera
cameras
camp
campaign
campaigns
camps
campus
can
canada
canadian
canceled
cancer
candidate
candidates
cannot
cap
capabilities
capable
capacity
cape
capital
capsule
captain
captors
capture
captured
car
card
cardinals
cards
care
career
cargo
caribbean
carl
carlos
carolina
carried
carrier
carriers
carries
carry
carrying
cars
cartel
carter
case
cases
cash
casino
cassini
cast
casualties
cat
catch
catholic
caught
cause
caused
causing
caution
cautious
cavaliers
cbc
cbs
cd
cease
celebrate
celebrated
celebration
cell
cellphone
cells
cellular
celtic
celtics
cent
center
centers
central
centre
cents
century
ceo
ceremony
certain
certainly
chad
chain
chairman
challenge
challenger
challenges
champ
champion
champions
championship
championships
chance
chancellor
chances
change
changed
changes
changing
channel
chaos
chapter
charge
charged
chargers
charges
charging
charles
charley
charlie
charlotte
chart
chase
chavez
cheap
cheaper
chechen
chechnya
check
checks
chelsea
chemical
chen
cheney
chicago
chief
chiefs
child
children
chile
china
chinese
chip
chipmaker
chips
chirac
choice
choose
chosen
chris
christian
christmas
chrysler
church
cia
cincinnati
cingular
circuit
circulation
cisco
cities
citigroup
citing
citizens
city
civil
civilian
civilians
claim
claimed
claiming
claims
clash
clashes
class
classic
clean
clear
cleared
clearing
clears
clemens
cleric
cleveland
client
clients
climate
climb
climbed
clinch
clinched
clinical
clinton
clippers
clock
cloning
close
closed
closely
closer
closes
closest
closing
clothing
cloud
club
clubs
clues
cnn
co
coach
coaches
coaching
coal
coalition
coast
coca
code
coffee
cola
cold
colin
collapse
collapsed
college
colombia
color
colorado
colts
columbia
column
com
combat
combined
comcast
come
comeback
comes
coming
command
commander
comments
commerce
commercial
commission
commissioner
commitment
committed
committee
common
communication
communications
communist
community
companies
company
compared
compensation
compete
competing
competition
competitive
competitors
complaint
complaints
complete
completed
completing
complex
components
compound
compromise
computer
computers
computerworld
computing
concern
concerned
concerns
concessions
concluded
condemned
condition
conditions
conduct
conducted
conference
confidence
confident
confirm
confirmed
confirms
conflict
conglomerate
congo
congress
congressional
connect
connecticut
connection
connections
conrad
consecutive
conservative
consider
considered
considering
considers
console
consortium
conspiracy
constitution
construction
consumer
consumers
contact
content
contest
continental
continue
continued
continues
continuing
contract
contractor
contracts
control
controlled
controls
controversial
controversy
convention
convicted
conviction
convoy
conway
cool
cooper
cooperation
copies
copy
copyright
core
corner
cornerback
corp
corporate
corporation
corruption
cos
cost
costly
costs
could
couldn
council
count
counter
counting
countries
country
county
coup
couple
course
court
courts
cover
coverage
cow
cowboys
cp
crack
crackdown
craft
craig
crash
crashed
crashes
crawford
create
created
creates
creating
creation
credit
creditors
crew
cricket
crime
crimes
criminal
crisis
critical
criticism
criticized
critics
crm
cross
crossing
crowd
crowded
crown
crucial
crude
crunch
crystal
cuba
cuban
cubs
culture
cup
curb
currency
current
currently
curse
curt
custody
customer
customers
cut
cuts
cutting
cyber
cybersecurity
cycling
czech
d
daily
daimlerchrysler
dallas
damage
damaged
damages
damascus
dame
dan
danger
dangerous
daniel
danny
darfur
dark
data
database
date
dave
davenport
david
davis
dawn
day
days
dc
de
dead
deadliest
deadline
deadly
deal
dealers
dealing
deals
death
deaths
debate
debt
debut
debuts
dec
decade
decades
december
decide
decided
decision
declared
decline
declined
declines
deep
defeat
defeated
defeats
defence
defend
defended
defender
defending
defends
defense
defensive
deficit
definition
del
delaware
delay
delayed
delays
delegates
delegation
delhi
deliver
delivered
delivers
delivery
dell
delta
demand
demanded
demanding
demands
democracy
democrat
democratic
democrats
denied
denies
denver
department
departure
deploy
deployment
depot
deputy
derek
described
description
desert
design
designed
desktop
desktops
desperate
despite
destroyed
destruction
details
detained
detainees
determine
determined
detroit
deutsche
devastated
devastating
develop
developed
developer
developers
developing
development
device
devices
devil
dhaka
dialogue
diamondbacks
dick
did
didn
die
died
diego
dies
different
difficult
digital
dip
diplomat
diplomatic
diplomats
direct
direction
directly
director
directors
disappointed
disappointing
disarm
disaster
disc
disclosed
discount
discovered
discovery
discuss
disease
disk
dismissed
disney
display
dispute
disputed
disruptions
distance
distribution
district
divided
dividend
division
dna
do
docomo
doctor
doctors
document
documents
dodgers
does
doesn
doing
dollar
dollars
dolphins
domain
domestic
dominance
dominant
dominate
dominated
don
donald
done
door
doping
dot
double
doubleclick
doubled
doubles
doubt
doubts
dow
down
download
downloads
dozen
dozens
dr
draft
drama
dramatic
draw
drawn
draws
dream
dreams
dreamworks
drew
drive
driven
driver
drivers
drives
driving
drop
dropped
dropping
drops
drought
drove
drug
drugs
ds
dual
dubai
dubbed
due
durable
during
dust
dutch
dvd
dvds
e
each
eagles
earlier
early
earn
earned
earnhardt
earnings
earns
earth
earthquake
earthquakes
ease
eased
eases
easier
easily
easing
east
eastern
easy
ebay
eclipse
economic
economists
economy
edge
edged
edges
edition
editor
eds
education
edwards
effect
effective
effects
effort
efforts
egypt
egyptian
eight
eighth
eisner
either
el
elect
elected
election
elections
electoral
electric
electrical
electricity
electronic
electronics
eli
eliminate
eliot
elite
els
else
elsewhere
em
email
embargo
embassy
embattled
emc
emerge
emerged
emergency
emerging
emissions
empire
employee
employees
employers
employment
enable
encounter
end
endangered
ended
ending
ends
energy
enforcement
engine
engineer
engineering
engineers
engines
england
english
enough
enrichment
enron
ensure
enter
entered
entering
enterprise
enterprises
enters
entertainment
entire
entry
environment
environmental
envoy
equatorial
equipment
equity
era
eric
ericsson
eriksson
ernie
error
errors
erupted
escape
especially
espn
established
estate
estimate
estimated
estimates
eta
ethnic
eu
euro
europe
european
europeans
euros
eve
even
evening
event
events
eventually
ever
everton
every
everyone
everything
evidence
evolution
ex
exactly
exchange
exclusive
exec
execs
executive
executives
exercise
exhibition
existing
exit
expand
expanded
expanding
expands
expansion
expect
expectations
expected
expects
expenses
expensive
experience
experimental
expert
experts
explain
exploded
exploration
explorer
explosion
explosions
explosives
export
exporter
exporters
exports
expos
express
expressed
extend
extended
extending
extends
extension
extra
extreme
eye
eyes
f
f1
fa
face
faced
faces
facilities
facility
facing
fact
factor
factories
factory
fail
failed
failing
fails
failure
fair
fake
falcons
fall
fallen
falling
falls
falluja
fallujah
false
fame
familiar
families
family
famous
fan
fannie
fans
far
farm
farmers
fashion
fast
faster
fastest
fat
fate
father
favor
favorite
favourite
favre
fbi
fcc
fda
fear
feared
fears
feature
features
february
fed
federal
federation
federer
fedex
fee
feel
feeling
feels
fees
feet
fell
fellow
felt
female
fenway
ferguson
ferrari
few
fewer
fi
field
fields
fierce
fifa
fifth
fight
fighters
fighting
fights
figure
figures
file
filed
files
filing
fill
filled
film
filmmaker
films
final
finale
finally
finals
finance
financequotelookup
financial
financing
find
finding
finds
fine
fined
fines
finish
finished
finishing
finland
fire
fired
firefox
fires
firing
firm
firms
first
fiscal
fischer
fish
fit
five
fix
fixed
fixing
fla
flag
flagship
flash
flat
flaw
flaws
fleet
flew
flight
flights
flood
flooding
floods
floor
florida
flow
flu
fly
flying
fm
focus
focused
follow
followed
following
font
food
foods
fool
foot
football
for
forbes
force
forced
forces
forcing
ford
forecast
forecasts
foreign
foreigners
forest
forget
form
formal
formally
format
formed
former
formula
fort
forum
forward
fossil
fought
found
foundation
founder
four
fourth
fox
france
frances
franchise
francisco
frank
frankfurt
fraud
freddie
free
freed
freedom
freeze
french
fresh
freshman
friday
friend
friendly
friends
from
front
ft
fuel
fueled
full
fullquote
fully
fun
fund
funding
funds
funeral
further
future
futures
g
g5
gain
gained
gaining
gains
game
gamers
games
gaming
gap
garcia
garden
gartner
gary
gas
gasoline
gates
gateway
gather
gathered
gathering
gators
gave
gay
gaza
gdp
ge
gear
gen
gene
general
generation
genesis
genetic
geneva
genocide
george
georgia
german
germany
get
gets
getting
ghraib
giant
giants
gift
girl
girls
give
given
gives
giving
glazer
global
globe
glory
gm
gmail
go
goal
goals
goes
going
gold
golden
goldman
golf
gone
good
goods
goog
google
gop
goran
gordon
got
gov
governing
government
governments
governor
govt
grab
grabbed
grace
grade
graeme
grand
grant
granted
graphics
great
greater
greatest
greece
greek
green
greenhouse
greenspan
grenade
grew
grid
grip
grizzlies
ground
group
groups
grow
growing
grows
growth
gt
guantanamo
guard
guards
guerrillas
guidance
guidant
guide
guilty
guinea
gulf
gun
gunmen
gunners
guns
guy
gymnastics
h
hackers
had
hague
hailed
haiti
haitian
half
hall
halliburton
halo
halt
halted
hamas
hamid
hamilton
hamm
hamstring
hand
handed
hander
handheld
handle
handling
hands
handset
handsets
happen
happened
happy
hard
hardware
harmony
harrington
harry
harvard
has
hasn
hassan
hat
have
haven
having
hawks
hd
he
head
headed
heading
headquarters
heads
health
healthy
hear
heard
hearing
heart
heat
heating
heavily
heavy
heavyweight
hedge
held
helens
helicopter
help
helped
helping
helps
helvetica
henman
henry
her
here
hero
hewitt
hewlett
high
higher
highest
highly
highs
hike
hikes
hill
hills
him
himself
hip
hire
hired
hiring
his
historic
history
hit
hitachi
hits
hitting
hockey
hold
holding
holdings
holds
hole
holes
holiday
holidays
hollinger
hollywood
holmes
holy
home
homeland
homer
homered
homers
homes
honda
hong
honor
hope
hoped
hopeful
hopes
hoping
hornets
horse
hospital
host
hostage
hostages
hostile
hosts
hot
hotel
hotels
hour
hours
house
houses
housing
houston
how
howard
however
hp
href
http
hu
hub
hubble
huge
hughes
hugo
human
humanitarian
humans
hundred
hundreds
hunger
hunt
hunting
hurricane
hurricanes
hurt
husband
hussein
hybrid
i
iaea
ian
ibm
icc
ice
ichiro
id
idc
idea
identification
identified
identify
identity
idg
ie
if
ii
ill
illegal
illegally
illinois
im
imac
image
images
imf
immediate
immediately
imminent
impact
important
imports
impose
imposed
impressive
improper
improve
improved
improvement
improving
in
inaugural
inc
inch
incident
include
included
includes
including
income
increase
increased
increases
increasing
increasingly
independence
independent
index
india
indian
indiana
indianapolis
indians
indicated
indicted
indies
individual
indonesia
indonesian
industrial
industries
industry
infineon
inflation
influence
info
information
infotype
infoworld
infrastructure
infringement
initial
initiative
injured
injuries
injuring
injury
inning
innings
inquiry
inside
insisted
insists
install
instant
instead
institute
instruments
insurance
insurer
insurers
insurgency
insurgent
insurgents
intc
integrated
integration
intel
intellectual
intelligence
intended
intends
intense
inter
interest
interested
interests
interim
interior
internal
international
internet
interview
into
introduce
introduced
introduces
invasion
inventories
inventory
invest
investigate
investigating
investigation
investigators
investment
investments
investor
investors
involved
involvement
involving
ioc
iowa
ip
ipo
ipod
ira
iran
iranian
iraq
iraqi
iraqis
ireland
irish
is
islamabad
islamic
islamist
island
islands
isn
israel
israeli
israelis
issue
issued
issues
it
italian
italy
itanium
ite
items
its
itself
itunes
ivan
ivory
iyad
j
jack
jackson
jacksonville
jacques
jaguar
jaguars
jail
jailed
jakarta
jamaica
jamal
james
jan
january
japan
japanese
jason
java
jay
jays
jazeera
jazz
jean
jeanne
jeeves
jeff
jeremy
jersey
jerusalem
jet
jets
jewish
jhtml
jim
job
jobless
jobs
joe
john
johnson
join
joined
joining
joins
joint
jointly
jon
jonathan
jones
jordan
jose
journal
journalist
journalists
joy
jp
jpeg
jr
juan
judge
judges
july
jump
jumped
jumps
june
junior
junk
jury
just
justice
justin
juventus
k
kabul
kansas
karzai
kashmir
kathmandu
kazaa
keep
keeping
keeps
ken
kennedy
kenneth
kenya
kept
kerry
kevin
key
khan
khartoum
kick
kicked
kidnapped
kidnappers
kidnapping
kids
kiev
kill
killed
killer
killing
kills
kim
kind
king
kingdom
kings
klitschko
kmart
knee
knew
knicks
knocked
know
known
knows
kobe
kodak
kofi
koizumi
kong
korea
korean
kreme
kremlin
krispy
kurt
kuwait
kyoto
l
la
lab
labels
labor
laboratory
labour
lack
laden
laid
lake
lakers
land
landed
landing
landmark
lands
langer
language
lanka
laptop
large
largely
larger
largest
larry
las
laser
last
late
later
latest
latin
launch
launched
launches
launching
law
lawmakers
laws
lawsuit
lawsuits
lawyer
lawyers
lay
lcd
lead
leader
leaders
leadership
leading
leads
league
learn
learned
learning
least
leave
leaves
leaving
lebanese
lebanon
led
lee
left
leg
legal
legend
legislation
lehman
lenovo
less
let
lets
letter
level
levels
lewis
liberty
libraries
library
libya
license
licensing
life
lift
lifted
lifting
lifts
light
lights
like
likely
limit
limited
limits
lindsay
line
linebacker
lines
lineup
link
linked
links
linux
lions
list
listed
little
live
lived
liverpool
lives
living
ll
llc
lleyton
loan
loans
local
lock
locked
lockout
london
long
longer
longest
longhorn
longtime
look
looked
looking
looks
los
lose
loses
losing
loss
losses
lost
lot
louis
louisiana
louisville
love
low
lowe
lower
lowered
lowers
lowest
lows
lsu
lt
ltd
lucent
lucrative
lukoil
lunar
lure
luxury
lycos
lying
lynch
lyon
m
mac
maccentral
machine
machines
mad
made
madison
madrid
mae
magazine
magic
magnitude
mail
mails
main
maine
maintain
major
majority
make
maker
makers
makes
making
malaysia
malaysian
malcolm
malicious
man
manage
managed
management
manager
managers
managing
manchester
manhattan
manmohan
manned
manning
manufacturer
manufacturers
manufacturing
many
maoist
map
marathon
march
margaret
maria
marine
mariners
marines
marion
mark
marked
market
marketing
markets
marking
marks
marlins
marriage
mars
marsh
mart
martha
martin
martinez
mary
maryland
mass
massachusetts
massacre
massive
masters
match
matches
matchup
material
materials
matt
matter
mauresmo
mavericks
may
maybe
mayor
mcafee
mcdonald
mci
mclennan
mcnair
md
me
mean
means
meant
measure
measures
medal
medals
media
medical
medicine
medium
meet
meeting
meetings
meets
melbourne
member
members
membership
memory
memphis
men
merck
mercury
merge
merger
merrill
message
messages
messaging
met
metal
meter
meters
mets
mexican
mexico
meyer
mgm
miami
mice
mich
michael
michigan
mickelson
micro
microsoft
microsystems
mid
middle
midfielder
might
mike
milan
mile
miles
milestone
militant
militants
military
militia
miller
million
millions
milosevic
milwaukee
mind
mine
miners
mini
mining
minister
ministers
ministry
minnesota
minor
minority
minute
minutes
miss
missed
misses
missile
missiles
missing
mission
mississippi
missouri
mistake
mistakes
mitsubishi
mixed
mlb
mln
mo
mobile
mode
model
models
moderate
modern
modest
moment
moments
momentum
monday
monetary
money
monitor
monitoring
monitors
montgomerie
month
monthly
months
montreal
moon
more
morgan
morning
mortar
mortgage
moscow
mosque
moss
most
mostly
mosul
mother
motion
motor
motorola
motors
mount
mountain
mourinho
mourning
mouse
move
moved
movement
moves
movie
movies
moving
mozilla
mp3
mph
mr
ms
msft
msn
much
multi
multimedia
multiple
mumbai
munich
murder
murdoch
musab
museum
musharraf
music
muslim
muslims
must
mutu
mutual
mvp
mw
my
myanmar
mysterious
mystery
n
najaf
name
named
names
napster
narrow
nasa
nascar
nasdaq
nation
national
nationals
nations
nationwide
native
nato
natural
nature
navy
nba
nbc
nc
ncaa
neal
near
nearly
nears
nec
necessary
neck
need
needed
needs
negative
negotiate
negotiating
negotiations
negotiators
nepal
net
netflix
netherlands
nets
netscape
network
networking
networks
never
new
newcastle
newest
newly
newratings
news
newsfactor
newspaper
newspapers
next
nextel
nfc
nfl
nhl
nick
nigeria
nigerian
night
nightmare
nikkei
nine
nintendo
ninth
nl
no
nobel
nokia
non
normal
nortel
north
northeast
northeastern
northern
northwest
norway
norwegian
not
note
notebook
notes
nothing
notice
notre
nov
novell
november
now
ntt
nuclear
nuggets
nuke
number
numbers
nvidia
ny
nyse
nz
o
oakland
observers
occupied
ocean
oct
october
odds
of
off
offense
offensive
offer
offered
offering
offerings
offers
office
officer
officers
offices
official
officially
officials
offset
offshore
often
ohio
oil
ok
oklahoma
oks
old
older
olympic
olympics
on
once
one
ones
ongoing
online
only
ontario
onto
opec
open
opened
opener
opening
opens
operate
operating
operation
operations
operator
operators
opinion
opponent
opponents
opportunity
opposition
opteron
optimism
optimistic
option
options
or
oracle
orange
orbit
orcl
order
ordered
orders
oregon
organisation
organization
organizations
original
orioles
orlando
orleans
ortiz
os
osama
other
others
ottawa
our
ousted
out
outcome
outfielder
outlook
output
outside
outsourcing
over
overall
overcame
overcome
overhaul
overnight
overseas
overtime
ovitz
owen
owens
own
owned
owner
owners
ownership
owns
p
p2p
pa
pace
pacers
pacific
pack
package
packard
packed
packers
pact
padres
page
pages
paid
pain
pair
pakistan
pakistani
palace
palestinian
palestinians
palm
palmone
palmsource
panama
panel
panthers
paper
par
parent
parents
paris
park
parliament
parliamentary
parmalat
part
particularly
parties
partner
partners
partnership
parts
party
pass
passed
passenger
passengers
passes
passing
past
patch
patches
patent
patents
path
patients
patrick
patriots
paul
paula
pay
paying
payment
payments
paypal
pays
pc
pcs
pct
peace
peacekeepers
peak
pedro
peer
penalties
penalty
penn
pennington
pennsylvania
pension
pensions
pentagon
pentium
people
peoplesoft
per
percent
percentage
perfect
performance
perhaps
period
permanent
permission
person
personal
peru
pervez
peter
peterson
petroleum
peyton
pfizer
pga
pharmaceutical
pharmaceuticals
phase
phelps
phil
philadelphia
philippine
philippines
philips
phillies
phishing
phoenix
phone
phones
photo
photos
physical
pick
picked
picks
picture
pictures
piece
pieces
pierce
pilot
pilots
pinochet
pioneer
pipeline
piracy
pirates
pistons
pitcairn
pitch
pitched
pitcher
pitching
pittsburgh
place
placed
places
plagued
plan
plane
planes
planet
planets
planned
planning
plans
plant
plants
platform
play
played
player
players
playing
playoff
playoffs
plays
playstation
plc
plea
plead
pleaded
pleads
please
pledge
pledged
pledges
plenty
plot
plunged
plus
pm
pocket
point
points
poised
poland
pole
police
policemen
policies
policy
polish
political
politicians
politics
poll
polls
pollution
pool
poor
pop
pope
popular
popularity
population
porn
port
portable
portfolio
portland
porto
position
positions
positive
possibility
possible
possibly
post
posted
posting
postponed
posts
postseason
potential
potentially
pound
pounded
pounds
poverty
powell
power
powered
powerful
powers
practice
practices
praise
pre
predict
predicted
preliminary
premier
premiership
prepare
prepared
prepares
preparing
prescription
preseason
presence
present
presidency
president
presidential
press
pressure
pretty
prevent
preview
previous
previously
price
priced
prices
pricing
primary
prime
prince
prior
priority
prison
prisoner
prisoners
privacy
private
privately
prix
prize
pro
probably
probe
probes
problem
problems
process
processing
processor
processors
produce
produced
producer
producers
producing
product
production
products
professional
professionals
profile
profit
profits
program
programme
programs
progress
project
projects
prominent
promise
promised
promises
promising
promote
prompted
prompting
proof
property
proposal
proposals
proposed
prosecutor
prosecutors
prospect
prospects
protect
protection
protest
protesters
protests
protocol
prove
proved
provide
provided
provider
providers
provides
providing
province
psft
psp
pt
public
publicly
published
publisher
publishing
pull
pulled
pulling
pullout
pulls
punch
purchase
purdue
pursue
pursuit
push
pushed
pushes
pushing
put
putin
puts
putting
pyongyang
q
q3
qaeda
qaida
qantas
qb
qcat
qtype
quake
qualcomm
qualifier
qualifying
quality
quarter
quarterback
quarterfinals
quarterly
quarters
queen
quest
question
questionable
questioned
questions
quick
quickinfo
quickly
quiet
quietly
quit
quite
quits
quot
quote
quoted
qwest
r
race
races
racing
radcliffe
radical
radio
rafael
raid
raiders
raids
rain
raise
raised
raises
raising
rallied
rally
ramallah
ramirez
rams
ran
randy
range
rangers
ranging
ranked
ranking
rankings
ranks
rape
rapid
rapidly
raptors
rare
rate
rates
rather
rating
ratings
ravaged
ravens
ray
rays
re
reach
reached
reaches
reaching
reaction
read
reader
readies
reading
ready
real
reality
really
realnetworks
reason
reasons
rebel
rebels
rebound
rebounded
rebounds
recall
recalled
recalls
receive
received
receiver
receiving
recent
recently
record
recorded
recording
records
recover
recovered
recovering
recovery
red
reds
redskins
reduce
reduced
reducing
reduction
referendum
reform
reforms
refugee
refugees
refused
regarding
regime
region
regional
regions
regular
regulations
regulator
regulators
regulatory
reject
rejected
rejects
related
relations
relationship
relatively
relatives
relay
release
released
releases
releasing
relief
reliever
religious
remain
remained
remaining
remains
remember
remote
remove
removed
renault
renewed
rental
repair
repeat
replace
replaced
replacement
replacing
report
reported
reportedly
reporter
reporters
reporting
reports
representatives
representing
republic
republican
republicans
reputation
request
require
required
rescue
rescuers
research
researchers
reserve
reserves
residents
resign
resignation
resigned
resigns
resistance
resolution
resolve
resort
resources
response
responsibility
responsible
rest
restore
restructuring
result
results
resume
resumed
retail
retailer
retailers
retain
retire
retired
retirement
retreat
return
returned
returning
returns
reuters
reveal
revealed
reveals
revenge
revenue
revenues
review
reviews
revised
revive
revolution
rfid
rice
rich
richard
rick
ricky
ride
rigging
right
rights
rim
ring
rio
ripped
rise
rises
rising
risk
risks
rival
rivalry
rivals
river
road
robert
robinson
robot
robust
rock
rocked
rocket
rockets
rockies
rocks
roddick
rodriguez
roger
role
roll
rolled
rolling
rolls
roma
roman
romania
rome
ron
rookie
room
rooney
rose
rossi
roster
round
rounds
roundup
rout
route
rover
rovers
row
roy
royal
royals
rugby
rule
ruled
rules
ruling
rumsfeld
run
runner
running
runs
rupert
rush
rushed
rushing
russia
russian
ruud
rwanda
rwandan
ryan
ryder
s
sa
sacked
sacramento
saddam
sadr
safe
safety
safin
said
saints
salary
sale
sales
salvation
samarra
same
samsung
san
sanctions
sans
santa
santander
santiago
sap
sat
satellite
saturday
saturn
saudi
save
saving
savings
saw
say
saying
says
sbc
scale
scam
scandal
scare
scene
schedule
scheduled
scheme
schilling
school
schools
schumacher
schwab
science
scientific
scientist
scientists
sco
score
scored
scores
scoring
scotland
scott
scottish
screen
sea
seahawks
sean
search
searching
sears
season
seasons
seat
seats
seattle
sec
second
seconds
secret
secretary
sector
secure
securities
security
see
seed
seeded
seeing
seek
seeking
seeks
seem
seemed
seems
seen
sees
seized
selected
self
sell
selling
sells
semi
semiconductor
semifinal
semifinals
sen
senate
senator
send
sender
sending
sends
senior
sense
sensitive
sent
sentence
sentenced
sentiment
seoul
sep
separate
separatist
sept
september
serb
serena
serie
series
serif
serious
seriously
serve
server
servers
service
services
serving
session
set
setback
sets
setting
settle
settled
settlement
settlements
settlers
settles
seven
seventh
several
severe
sex
sexual
shadow
shake
shanghai
shape
sharapova
share
shared
shareholder
shareholders
shares
sharing
sharon
sharp
sharply
shaukat
shawn
she
shed
shell
shi
shift
shiite
ship
shipments
shipping
ships
shock
shook
shoot
shooting
shootout
shop
shoppers
shopping
short
shortage
shortly
shot
shots
should
shoulder
show
showdown
showed
showing
shown
shows
shrine
shut
shuttle
side
sidelined
sides
siebel
siege
siemens
sight
sights
sign
signal
signals
signed
significant
significantly
signing
signs
silicon
siliconvalley
silver
similar
simple
simply
since
singapore
singh
single
singles
sir
sirius
sit
site
sites
sitting
situation
six
sixth
size
sized
skipper
sky
slain
slam
slammed
slams
slash
slashed
slid
slide
slight
slightly
slip
slipped
slips
slow
slowdown
slowed
slower
slowing
slowly
slows
sluggish
slump
small
smaller
smart
smith
snap
snow
so
soar
soared
soaring
soars
soccer
social
society
soft
software
solar
solaris
sold
soldier
soldiers
solid
solution
solutions
some
someone
something
sometimes
son
song
songs
sony
soon
sorenstam
sought
sound
souness
source
sources
south
southampton
southeast
southeastern
southern
southwest
sox
soyuz
sp2
space
spacecraft
spaceshipone
spain
spam
spammers
spanish
sparked
sparks
speaking
special
species
specific
spectacular
speculation
speech
speed
speedway
spend
spending
spent
spin
spirit
spitzer
split
spoke
spokesman
spokeswoman
sponsored
sport
sporting
sports
spot
spotlight
spots
spread
spring
sprint
sprinters
spurrier
spurs
spy
spyware
squad
square
sri
st
stability
stable
stadium
staff
stage
stake
stakes
stalled
stand
standard
standards
standing
standings
standoff
stands
stanford
stanley
star
starbucks
stars
start
started
starter
starting
starts
state
statement
states
station
stations
status
stay
stayed
stays
steady
steam
steel
steelers
stem
step
stephen
stepped
stepping
steps
stern
steroid
steroids
steve
stewart
stick
still
stock
stockholm
stocks
stolen
stood
stop
stopped
stops
storage
store
stores
storm
stormed
storms
story
straight
strained
strategic
strategy
straw
streak
street
streets
strength
strengthen
stretch
strike
striker
strikes
striking
string
strip
stripped
stroke
strokes
strong
stronger
strongest
stronghold
struck
struggle
struggled
struggles
struggling
student
students
studies
studio
studios
study
stuff
stunning
style
subject
submarine
subscribers
subsidiary
subsidies
succeed
success
successful
successfully
successor
such
sudan
sudanese
suddenly
sue
sued
sues
suffer
suffered
suffering
suggest
suggested
suggesting
suggests
suicide
suing
suit
suite
suits
summary
summer
summit
sun
sunday
sunni
suns
super
supercomputer
supermarket
supplier
supplies
supply
support
supported
supporters
supporting
supports
supposed
supreme
sure
surface
surge
surged
surgery
surging
surprise
surprised
surprising
surrounding
survey
survival
survive
survived
survivors
suspect
suspected
suspects
suspend
suspended
suspension
suspicion
sustained
suzuki
sven
swap
swapping
sweden
swedish
sweep
sweeping
sweet
swept
swift
swimming
swing
swiss
switch
switches
switzerland
sydney
sym
symantec
symbian
syracuse
syria
syrian
system
systems
t
table
tackle
taipei
taiwan
take
taken
takeover
takes
taking
talent
taliban
talk
talking
talks
tampa
tanks
tap
tape
target
targeted
targeting
targets
task
tax
taxes
taylor
td
team
teammate
teammates
teams
tech
technical
technologies
technology
techweb
teenager
tehran
tel
telecom
telecommunications
telecoms
telephone
telephony
telescope
television
tell
telling
tells
telstra
temporarily
temporary
ten
tender
tendulkar
tennessee
tennis
tens
tensions
tentative
term
terms
territory
terror
terrorism
terrorist
terrorists
terry
test
tested
testing
tests
texas
text
textile
thai
thailand
than
thanks
thanksgiving
that
thatcher
the
theft
their
them
themselves
then
theory
there
these
they
thin
thing
things
think
thinking
thinks
third
this
thomas
those
though
thought
thousands
threat
threaten
threatened
threatening
threatens
threats
three
threw
through
throughout
throw
throwing
thrown
throws
thursday
ticker
ticket
tickets
tie
tied
ties
tiger
tigers
tight
tim
timberwolves
time
times
tiny
tip
titan
titans
title
titles
tivo
to
tobacco
today
together
tokyo
told
toll
tom
tommy
tomorrow
tonight
tony
too
took
tool
tools
top
tops
torn
toronto
toshiba
total
tottenham
touch
touchdown
touchdowns
tough
tougher
tour
tourism
tourists
tournament
toward
towards
town
toy
toyota
toys
track
tracking
tracks
trade
traded
traders
trading
traditional
traffic
trafford
trail
train
training
transactions
transfer
transport
transportation
trapped
travel
travelers
treasuries
treasury
treat
treated
treatment
treaty
tree
trees
trend
treo
trial
trials
tribunal
trick
tried
tries
triggered
trio
trip
triple
triumph
trojan
troop
troops
trophy
tropical
trouble
troubled
troy
truck
trucks
true
trump
trust
try
trying
tsunami
tuesday
turkey
turkish
turmoil
turn
turned
turning
turns
tv
tvs
twice
twin
twins
two
tycoon
type
typhoon
u
u2
uefa
uk
ukraine
ukrainian
un
unable
unbeaten
uncertain
uncertainty
unchanged
under
understand
unemployment
unexpected
unexpectedly
union
unions
unique
unit
united
units
universal
universe
university
unix
unknown
unless
unlikely
unprecedented
unrest
until
unusual
unveil
unveiled
unveils
up
upbeat
upcoming
update
update1
update2
update3
updated
updates
upgrade
upgrades
upon
uprising
ups
upset
uranium
urban
urge
urged
urges
urging
us
usa
usatoday
usc
use
used
user
users
uses
using
usual
usually
utah
utility
v
va
vaccine
valencia
valley
valuable
value
van
vancouver
various
vast
ve
vegas
vehicle
vehicles
vendor
vendors
venezuela
venezuelan
venture
venus
verdana
verge
veritas
verizon
version
versions
versus
very
veteran
veterans
via
viacom
vice
victim
victims
victories
victory
video
vienna
vietnam
view
views
vijay
vikings
viktor
villa
village
vince
violating
violations
violence
violent
vioxx
virgin
virginia
virtual
virtually
virus
viruses
visa
vision
visit
visiting
visitors
visits
vital
vivendi
vladimir
vodafone
voice
voip
volatile
volkswagen
volume
vonage
vote
voted
voters
votes
voting
vowed
vows
vs
vulnerabilities
vulnerability
vulnerable
w
wage
wait
waiting
wake
wal
wales
walk
walked
walker
wall
walt
want
wanted
wants
war
warming
warn
warned
warner
warning
warnings
warns
warplanes
warriors
wars
was
washington
washingtonpost
wasn
watch
watchdog
watched
watching
water
waters
wave
waves
way
wayne
ways
we
weak
weaker
weakness
weapons
wearing
weather
web
website
wednesday
week
weekend
weekly
weeks
weigh
weighed
weighs
weight
welcome
welcomed
well
wells
wenger
went
were
west
western
whales
what
when
where
whether
which
while
white
who
whole
wholesale
whose
why
wi
wicket
wickets
wide
widely
wider
widespread
wife
wild
wildlife
will
william
williams
willing
wimax
wimbledon
win
wind
windows
winds
wine
wing
winner
winners
winning
wins
winter
wire
wired
wireless
wisconsin
with
withdraw
withdrawal
withdrew
within
without
witness
witnesses
wizards
wmt
woes
woman
women
won
wonder
woods
word
words
work
worked
worker
workers
workforce
working
works
world
worlds
worldwide
worm
worms
worried
worries
worry
worse
worst
worth
would
wouldn
wounded
wounding
wounds
wrap
write
writer
writes
written
wrong
wta
wto
www
x
xbox
xm
xp
y
yahoo
yankee
yankees
yanks
yard
yards
yasser
year
years
yellow
yen
yesterday
yet
york
you
young
your
yudhoyono
yukos
zarqawi
zealand
ziff
zimbabwe
zone
zook
zurich